USE simple_library;
INSERT INTO
	libraries (name, address)
VALUES
	("Библиотека им. А. С. Пушкина", "ул. Пушкина, д. 13"),
	("Библиотека им. Л. Н. Толстого", "ул. Льва Толстого, д. 13"),
	("Библиотека им. Н. В. Гоголя", "ул. Гоголя, д. 13"),
	("Библиотека им. М. А. Булгакова", "ул. Булгакова, д. 13");
INSERT INTO
	readers (last_name, first_name, patronymic)
VALUES
	("Иванов", "Иван", "Иванович"),
	("Петров", "Пётр", "Петрович"),
	("Сидоров", "Сидор", "Сидорович"),
	("Кузьмин", "Кузьма", "Кузьмич"),
	("Павлов", "Павел", "Павлович"),
	("Александрова", "Александра", "Александровна"),
	("Антонов", "Антон", "Антонович"),
	("Андреев", "Андрей", "Андреевич"),
	("Степанов", "Степан", "Степанович"),
	("Коновалов", "Жан", "Петрович");
INSERT INTO
	books (library_id, title, author, year) 
VALUES
	(1, "Капитанская дочка", "А. С. Пушкин", "1976"),
	(1, "Евгений Онегин", "А. С. Пушкин", "1976"),
	(1, "Полное издание сочинений: том I", "А. С. Пушкин", "1976"),
	(1, "Полное издание сочинений: том II", "А. С. Пушкин", "1976"),
	(1, "Полное издание сочинений: том IV", "А. С. Пушкин", "1976"),
	(1, "Драматические произведения", "А. С. Пушкин", "1976"),
	(1, "Рога и Копыта", "Ж. П. Коновалов", "2016"),
	(2, "Война и мир: том I", "Л. Н. Толстой", "1975"),
	(2, "Война и мир: том II", "Л. Н. Толстой", "1975"),
	(2, "Рога и Копыта", "Ж. П. Коновалов", "2016"),
	(2, "Война и мир: том III", "Л. Н. Толстой", "1976"),
	(2, "Война и мир: том IV", "Л. Н. Толстой", "1976"),
	(2, "Анна Каренина", "Л. Н. Толстой", "1976"),
	(3, "Ревизор", "Н. В. Гоголь", "1980"),
	(3, "Тарас Бульба", "Н. В. Гоголь", "1981"),
	(3, "Рога и Копыта", "Ж. П. Коновалов", "2016"),
	(3, "Мёртвые души", "Н. В. Гоголь", "1981"),
	(3, "Мёртвые души: том II", "Н. В. Гоголь", "2018"),
	(4, "Собачье сердце", "М. А. Булгаков", "1996"),
	(4, "Рога и Копыта", "Ж. П. Коновалов", "2016"),
	(4, "Мастер и Маргарита", "М. А. Булгаков", "1996"),
	(4, "Белая гвардия", "М. А. Булгаков", "1996");
INSERT INTO
	reader_library (reader_id, library_id)
VALUES
	(1, 1),
	(2, 2),
	(3, 3),
	(4, 4),
	(5, 1),
	(6, 2),
	(7, 3),
	(8, 4),
	(9, 1),
	(10, 2),
	(10, 3),
	(10, 4),
	(10, 1),
	(1, 2),
	(2, 3),
	(3, 4);
